{
  "nodes": [
    {
      "op": "null", 
      "name": "curr_env", 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape33", 
      "attr": {"shape": "(5000, -1)"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "curr_args", 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape34", 
      "attr": {"shape": "(5000, -1)"}, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "s_t", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[1, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "f_enc_fc1_weight", 
      "attr": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "f_enc_fc1_bias", 
      "attr": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "f_enc_fc1", 
      "attr": {"num_hidden": "256"}, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "f_enc_act1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "f_enc_weight", 
      "attr": {"num_hidden": "128"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "f_enc_bias", 
      "attr": {"num_hidden": "128"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "f_enc", 
      "attr": {"num_hidden": "128"}, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "curr_prog", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "prog_embedding_weight", 
      "attr": {
        "input_dim": "10", 
        "output_dim": "16"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "prog_embedding", 
      "attr": {
        "input_dim": "10", 
        "output_dim": "16"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape35", 
      "attr": {"shape": "(5000, -1)"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "curr_inputs", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[11, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "curr_inputs_fc1_weight", 
      "attr": {"num_hidden": "128"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "curr_inputs_fc1_bias", 
      "attr": {"num_hidden": "128"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "curr_inputs_fc1", 
      "attr": {"num_hidden": "128"}, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "curr_inputs_act1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "enc_inputs_weight", 
      "attr": {"num_hidden": "32"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "enc_inputs_bias", 
      "attr": {"num_hidden": "32"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "enc_inputs", 
      "attr": {"num_hidden": "32"}, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape36", 
      "attr": {"shape": "(100, 50, -1)"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split3", 
      "attr": {
        "axis": "1", 
        "num_outputs": "50", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l0_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l0_i2h_bias", 
      "attr": {"__init__": "[\"lstmbias\", {\"forget_bias\": 1.0}]"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t0_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l0_begin_state_0", 
      "attr": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 256)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l0_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l0_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t0_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus400", 
      "inputs": [[28, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t0_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[34, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t0_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[34, 1, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l0_begin_state_1", 
      "attr": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 256)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul800", 
      "inputs": [[36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t0_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t0_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[34, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul801", 
      "inputs": [[39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t0_state", 
      "inputs": [[38, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation400", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l0_t0_out", 
      "inputs": [[35, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "lstm_l1_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l1_i2h_bias", 
      "attr": {"__init__": "[\"lstmbias\", {\"forget_bias\": 1.0}]"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t0_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l1_begin_state_0", 
      "attr": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 256)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l1_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "lstm_l1_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t0_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus450", 
      "inputs": [[47, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t0_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[53, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t0_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[53, 1, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "lstm_l1_begin_state_1", 
      "attr": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 256)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul900", 
      "inputs": [[55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t0_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t0_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[53, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul901", 
      "inputs": [[58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t0_state", 
      "inputs": [[57, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation450", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l1_t0_out", 
      "inputs": [[54, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims200", 
      "attr": {"axis": "1"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t1_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[25, 1, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t1_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[44, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus401", 
      "inputs": [[65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t1_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[68, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t1_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[68, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul802", 
      "inputs": [[70, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t1_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t1_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[68, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul803", 
      "inputs": [[72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t1_state", 
      "inputs": [[71, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation401", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l0_t1_out", 
      "inputs": [[69, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t1_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[77, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t1_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[63, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus451", 
      "inputs": [[78, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t1_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[81, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t1_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[81, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul902", 
      "inputs": [[83, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t1_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t1_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[81, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul903", 
      "inputs": [[85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t1_state", 
      "inputs": [[84, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation451", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l1_t1_out", 
      "inputs": [[82, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims201", 
      "attr": {"axis": "1"}, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t2_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[25, 2, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t2_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[77, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus402", 
      "inputs": [[92, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t2_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[95, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t2_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[95, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul804", 
      "inputs": [[97, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t2_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t2_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[95, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul805", 
      "inputs": [[99, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t2_state", 
      "inputs": [[98, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation402", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l0_t2_out", 
      "inputs": [[96, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t2_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[104, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t2_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[90, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus452", 
      "inputs": [[105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t2_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[108, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t2_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[108, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul904", 
      "inputs": [[110, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t2_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t2_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[108, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul905", 
      "inputs": [[112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t2_state", 
      "inputs": [[111, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation452", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l1_t2_out", 
      "inputs": [[109, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims202", 
      "attr": {"axis": "1"}, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t3_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[25, 3, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t3_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[104, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus403", 
      "inputs": [[119, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t3_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t3_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[122, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t3_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[122, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul806", 
      "inputs": [[124, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t3_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t3_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[122, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul807", 
      "inputs": [[126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t3_state", 
      "inputs": [[125, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation403", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l0_t3_out", 
      "inputs": [[123, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t3_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[131, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t3_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[117, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus453", 
      "inputs": [[132, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t3_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t3_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[135, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t3_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[135, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul906", 
      "inputs": [[137, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t3_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t3_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[135, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul907", 
      "inputs": [[139, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t3_state", 
      "inputs": [[138, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation453", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l1_t3_out", 
      "inputs": [[136, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims203", 
      "attr": {"axis": "1"}, 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t4_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[25, 4, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t4_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[131, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus404", 
      "inputs": [[146, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t4_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t4_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[149, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t4_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[149, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul808", 
      "inputs": [[151, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t4_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t4_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[149, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul809", 
      "inputs": [[153, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t4_state", 
      "inputs": [[152, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation404", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l0_t4_out", 
      "inputs": [[150, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t4_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[158, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t4_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[144, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus454", 
      "inputs": [[159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t4_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t4_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[162, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t4_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[162, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul908", 
      "inputs": [[164, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t4_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t4_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[162, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul909", 
      "inputs": [[166, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t4_state", 
      "inputs": [[165, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation454", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l1_t4_out", 
      "inputs": [[163, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims204", 
      "attr": {"axis": "1"}, 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t5_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[25, 5, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t5_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[158, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus405", 
      "inputs": [[173, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t5_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t5_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[176, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t5_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[176, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul810", 
      "inputs": [[178, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t5_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t5_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[176, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul811", 
      "inputs": [[180, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t5_state", 
      "inputs": [[179, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation405", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l0_t5_out", 
      "inputs": [[177, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t5_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[185, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t5_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[171, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus455", 
      "inputs": [[186, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t5_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t5_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[189, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t5_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[189, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul910", 
      "inputs": [[191, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t5_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t5_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[189, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul911", 
      "inputs": [[193, 0, 0], [194, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t5_state", 
      "inputs": [[192, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation455", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l1_t5_out", 
      "inputs": [[190, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims205", 
      "attr": {"axis": "1"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t6_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[25, 6, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t6_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[185, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus406", 
      "inputs": [[200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t6_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t6_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[203, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t6_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[203, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul812", 
      "inputs": [[205, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t6_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t6_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[203, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul813", 
      "inputs": [[207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t6_state", 
      "inputs": [[206, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation406", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l0_t6_out", 
      "inputs": [[204, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t6_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[212, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t6_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[198, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus456", 
      "inputs": [[213, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t6_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t6_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[216, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t6_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[216, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul912", 
      "inputs": [[218, 0, 0], [196, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t6_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[216, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t6_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[216, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul913", 
      "inputs": [[220, 0, 0], [221, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t6_state", 
      "inputs": [[219, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation456", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[223, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l1_t6_out", 
      "inputs": [[217, 0, 0], [224, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims206", 
      "attr": {"axis": "1"}, 
      "inputs": [[225, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t7_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[25, 7, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t7_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[212, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus407", 
      "inputs": [[227, 0, 0], [228, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t7_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[229, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t7_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[230, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t7_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[230, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul814", 
      "inputs": [[232, 0, 0], [210, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t7_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[230, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t7_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[230, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul815", 
      "inputs": [[234, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t7_state", 
      "inputs": [[233, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation407", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l0_t7_out", 
      "inputs": [[231, 0, 0], [238, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t7_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[239, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t7_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[225, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus457", 
      "inputs": [[240, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t7_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t7_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[243, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t7_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[243, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul914", 
      "inputs": [[245, 0, 0], [223, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t7_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[243, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t7_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[243, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul915", 
      "inputs": [[247, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t7_state", 
      "inputs": [[246, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation457", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l1_t7_out", 
      "inputs": [[244, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims207", 
      "attr": {"axis": "1"}, 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t8_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[25, 8, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t8_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[239, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus408", 
      "inputs": [[254, 0, 0], [255, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t8_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[256, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t8_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[257, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t8_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[257, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul816", 
      "inputs": [[259, 0, 0], [237, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t8_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[257, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t8_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[257, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul817", 
      "inputs": [[261, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t8_state", 
      "inputs": [[260, 0, 0], [263, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation408", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[264, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l0_t8_out", 
      "inputs": [[258, 0, 0], [265, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t8_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[266, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t8_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[252, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus458", 
      "inputs": [[267, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t8_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[269, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t8_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[270, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t8_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[270, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul916", 
      "inputs": [[272, 0, 0], [250, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t8_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t8_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[270, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul917", 
      "inputs": [[274, 0, 0], [275, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t8_state", 
      "inputs": [[273, 0, 0], [276, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation458", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[277, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l1_t8_out", 
      "inputs": [[271, 0, 0], [278, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims208", 
      "attr": {"axis": "1"}, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t9_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[25, 9, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t9_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[266, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus409", 
      "inputs": [[281, 0, 0], [282, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t9_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[283, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t9_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[284, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t9_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[284, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul818", 
      "inputs": [[286, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t9_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[284, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t9_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[284, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul819", 
      "inputs": [[288, 0, 0], [289, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t9_state", 
      "inputs": [[287, 0, 0], [290, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation409", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l0_t9_out", 
      "inputs": [[285, 0, 0], [292, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t9_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[293, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t9_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[279, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus459", 
      "inputs": [[294, 0, 0], [295, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t9_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[296, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t9_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[297, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t9_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[297, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul918", 
      "inputs": [[299, 0, 0], [277, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t9_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[297, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t9_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[297, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul919", 
      "inputs": [[301, 0, 0], [302, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t9_state", 
      "inputs": [[300, 0, 0], [303, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation459", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[304, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l1_t9_out", 
      "inputs": [[298, 0, 0], [305, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims209", 
      "attr": {"axis": "1"}, 
      "inputs": [[306, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t10_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[25, 10, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t10_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[293, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus410", 
      "inputs": [[308, 0, 0], [309, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t10_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[310, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t10_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[311, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t10_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[311, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul820", 
      "inputs": [[313, 0, 0], [291, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t10_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[311, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t10_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[311, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul821", 
      "inputs": [[315, 0, 0], [316, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t10_state", 
      "inputs": [[314, 0, 0], [317, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation410", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[318, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l0_t10_out", 
      "inputs": [[312, 0, 0], [319, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t10_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[320, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t10_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[306, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus460", 
      "inputs": [[321, 0, 0], [322, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t10_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[323, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t10_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[324, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t10_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[324, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul920", 
      "inputs": [[326, 0, 0], [304, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t10_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[324, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t10_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[324, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul921", 
      "inputs": [[328, 0, 0], [329, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t10_state", 
      "inputs": [[327, 0, 0], [330, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation460", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[331, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l1_t10_out", 
      "inputs": [[325, 0, 0], [332, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims210", 
      "attr": {"axis": "1"}, 
      "inputs": [[333, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t11_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[25, 11, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t11_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[320, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus411", 
      "inputs": [[335, 0, 0], [336, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t11_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[337, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t11_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[338, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t11_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[338, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul822", 
      "inputs": [[340, 0, 0], [318, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t11_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[338, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t11_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[338, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul823", 
      "inputs": [[342, 0, 0], [343, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l0_t11_state", 
      "inputs": [[341, 0, 0], [344, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation411", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[345, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l0_t11_out", 
      "inputs": [[339, 0, 0], [346, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t11_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[347, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l1_t11_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[333, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus461", 
      "inputs": [[348, 0, 0], [349, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l1_t11_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[350, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t11_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[351, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t11_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[351, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul922", 
      "inputs": [[353, 0, 0], [331, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t11_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[351, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l1_t11_c", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[351, 2, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul923", 
      "inputs": [[355, 0, 0], [356, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "lstm_l1_t11_state", 
      "inputs": [[354, 0, 0], [357, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation461", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[358, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "lstm_l1_t11_out", 
      "inputs": [[352, 0, 0], [359, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims211", 
      "attr": {"axis": "1"}, 
      "inputs": [[360, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t12_i2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[25, 12, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "lstm_l0_t12_h2h", 
      "attr": {"num_hidden": "1024"}, 
      "inputs": [[347, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus412", 
      "inputs": [[362, 0, 0], [363, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "lstm_l0_t12_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[364, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t12_o", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[365, 3, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t12_f", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[365, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul824", 
      "inputs": [[367, 0, 0], [345, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t12_i", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[365, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "lstm_l0_t12_c", 
